module.exports.breakfast = 
`Завтрак состоит из трёх компонентов:
• белки  
• жиры  
• углеводы 

Напротив названия в плане питания указан рекомендованный вес продукта в граммах, в сыром виде. Например, завтрак может выглядеть примерно так:

  <b>Белки:</b>
• Мясо, птица - 180г
• Рыба, морепродукты - 230г 
• Субпродукты - 180г 
• Творог - 200г 
• Яйца - 3 шт 
• Йогурт - 350г 
• Кефир, ряженка - 395г  

  <b>Жиры:</b>
• Растительное масло - 15г 
• Сливочное масло - 20г 
• Орехи - 20г 
• Сыр - 45г 
• Авокадо - 65г

  <b>Углеводы:</b>
• Крупы, макароны - 60г 
• Фрукты, ягоды - 370г 
• Хлебцы - 85г 
• Сухофрукты - 85г 

Вам необходимо выбрать как минимум один компонент из каждой категории и составить комбинацию белки + жиры + углеводы 
Например: творог + орехи(арахис) + крупа(овсянка);  кефир + орехи(миндаль) + сухофрукты(курага); яйца + сыр(фета) + макароны 
Полный перечень продуктов ищите в таблице при составлении отчёта`;

module.exports.dinner = 
`Обед состоит из трёх компонентов
• белки  
• жиры  
• углеводы 

Напротив названия в плане питания указан рекомендованный вес продукта в граммах, в сыром виде. Например, обед может выглядеть примерно так:

  <b>Белки:</b> 
• Мясо, птица - 180г 
• Рыба, морепродукты - 230г 
• Субпродукты - 180г 
• Творог - 200г 
• Яйца  - 3 шт 
• Йогурт - 350г 
• Кефир, ряженка - 395г

  Жиры 
• Растительное масло - 15г 
• Сливочное масло - 20г 
• Орехи - 20г 
• Сыр - 45г 
• Авокадо - 65г

  Углеводы 
• Крупы, макароны - 60г 
• Фрукты, ягоды - 370г 
• Хлебцы - 85г 
• Сухофрукты - 85г

Вам необходимо выбрать как минимум один компонент из каждой категории и составить комбинацию белки + жиры + углеводы 
Например: cубпродукты(печень) + сливочное масло + крупа(гречка); мясо, птица(говядина) + сыр(пармезан) + крупа(рис);  яйца(омлет) + сыр(плавленный) + макароны 
Полный перечень продуктов ищите в таблице при составлении отчёта`;

module.exports.supper = 
`Ужин состоит из трёх компонентов  
• белки 
• углеводы 
• жиры 

Напротив названия в плане питания указан рекомендованный вес продукта в граммах, в сыром виде. Например, ужин может выглядеть примерно так:

*ужин*

Вам необходимо выбрать как минимум один компонент из каждой категории и составить комбинацию белки + жиры + углеводы, но углеводы следует выбирать преимущественно из фруктов, хлебцев и сухофруктов, не используя остальные медленные углеводы. 
`;

module.exports.lunch = 
`Напротив названия в плане питания указан рекомендованный вес продукта в граммах, в сыром виде. Например, перекус может выглядеть примерно так:

• Творог
• Cухофрукты (курага) 
• Cыр(твёрдый 45%) 
• Кефир
• Фрукты (яблоко) 
• Орехи
`;

module.exports.eatAndCook = 
`<b><u>Ешь, когда хочешь</u></b>
Время приема пищи не влияет на снижение веса, к тому же не всегда удаётся поесть в одно и то же время 
Ваша задача - уместить все приемы пищи из плана питания в промежуток между подъемом и отходом ко сну 
Завтрак может начаться в 5:00, 7:00, и даже 11:00 
Ужин может начаться в 18:00, 21:00 или в 00:00
Перекус можно делать между или вместе с любым из приемов пищи

<b><u>Готовь любым способом</u></b> 
Вы можете пользоваться любым существующим способом приготовления пищи, главное использовать рекомендуемые продукты в нужном количестве
Можно варить, тушить, запекать в духовке, жарить на гриле или антипригарной сковороде с тонким слоем масла 

Помните о том, что расчёт калорий необходимо проводить на вес сухих и сырых продуктов. Если мы хотим отварить 70г крупы, отмерим её любым способом (на весах, мерными ёмкостями, столовыми ложками (1 ст.л. = 13-15г крупы), «на глаз»). Смотрим на этикетку и получаем: калорийность 100г гречки - 335 кал, а 70г = 335 * 70 / 100 = 234.5 кал. При этом вес каши увеличится, а калорийность останется прежней. 

С грудкой всё иначе. При варке курица отдает до 20% калорийности в бульон, а сама уваривается где-то на 30%. Если вы отварили 200г грудки, имеющей 226 кал, то на выходе получите 140г варёного мяса (200 * 0.7 = 140) с калорийностью примерно 181 кал ( 226 - 0.8 = 181). 
Как быть с фруктами, орехами, семечками и др.? Лучше проверить калорийность через гугл`;

module.exports.dringAndVeg = 
`<b><u>Пей сколько хочешь и когда хочешь</u></b>
Мы рекомендуем выпивать стакан воды комнатной температуры после пробуждения и 1,5 литра воды в течении дня.
Пить можно до, во время и после еды, а также в течение дня или во время тренировки/прогулки.  
Чай и кофе также можно пить в любых количествах, но без молока и сахара!  

<b><u>Ешьте много овощей и зелени</u></b>  
Овощи можно есть без ограничений, они содержат мало калорий, но отлично снижают аппетит за счет содержания клетчатки.
Готовьте овощные салаты с разнообразной заправкой и яркие овощные нарезки.
Съедайте 2-3 порции овощей в день как дополнение к основному плану питания`;